apps/api-server/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramping up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
  variables:
    token: "{{ $randomString() }}"
  headers:
    Content-Type: "application/json"
    Authorization: "Bearer {{ token }}"

scenarios:
  - name: "API Flow"
    flow:
      # Create a queue and capture its ID
      - post:
          url: "/api/queues"
          json:
            name: "test-queue-{{ $randomString() }}"
            description: "Test queue for performance testing"
          capture:
            - json: "$.data.queue.id"
              as: "queueId"
            - json: "$.data.queue.name"
              as: "queueName"
      # Get server metrics
      - get:
          url: "/api/dashboard/server"
      # Get all queue metrics
      - get:
          url: "/api/dashboard/queues"
      # Publish a message to queue using captured queueId
      - post:
          url: "/api/messages/{{ queueId }}"
          json:
            data: "Test message {{ $randomString() }}"
      # Create a topic and capture its ID
      - post:
          url: "/api/topics"
          json:
            name: "test-topic-{{ $randomString() }}"
          capture:
            - json: "$.data.topic.id"
              as: "topicId"
      # Subscribe queue to topic using captured IDs
      - post:
          url: "/api/topics/{{ topicId }}/subscribe"
          json:
            queueId: "{{ queueId }}"
      # Publish to topic using captured topicId
      - post:
          url: "/api/topics/{{ topicId }}/publish"
          json:
            data: "Test topic message {{ $randomString() }}"